Repository: jenchienchang/asset-flow
Catalog: AssetFlow/Resources/Import.xcstrings
Source language: en
Languages: zh_hant

source: — Skip —
zh_hant: — 略過 —

source: %lld of %lld required columns mapped.
zh_hant: 已對應 %1$lld / %2$lld 個必填欄位。

source: Amount is zero for '%@'.
zh_hant: 「%@」的金額為零。

# Asset '%@' (platform: '%@') already exists in the snapshot for this date.
source: Asset '%1$@' (platform: '%2$@') already exists in the snapshot for this date.
zh_hant: 資產「%1$@」（平台：%2$@）已存在於此日期的快照中。

source: Asset name is empty.
zh_hant: 資產名稱為空。

source: Cancel
zh_hant: 取消

source: Cannot parse '%@' as a number.
zh_hant: 無法將「%@」解析為數字。

source: Cash flow '%@' already exists in the snapshot for this date.
zh_hant: 現金流「%@」已存在於此日期的快照中。

source: Confirm
zh_hant: 確認

source: Could not open file. Please check the file is a valid CSV.
zh_hant: 無法開啟檔案。請確認該檔案為有效的 CSV 格式。

source: Description is empty.
zh_hant: 描述為空。

source: Dropped CSV
zh_hant: 拖放的 CSV

# Duplicate asset '%@' (platform: '%@') — first appeared as '%@'.
source: Duplicate asset '%1$@' (platform: '%2$@') — first appeared as '%3$@'.
zh_hant: 重複的資產「%1$@」（平台：%2$@）— 首次出現為「%3$@」。

source: Duplicate asset '%@' (platform: '%@') — first appeared in row %lld.
zh_hant: 重複的資產「%1$@」（平台：%2$@）— 首次出現於第 %3$lld 列。

# Duplicate description '%@' — first appeared as '%@'.
source: Duplicate description '%1$@' — first appeared as '%2$@'.
zh_hant: 重複的描述「%1$@」— 首次出現為「%2$@」。

source: Duplicate description '%@' — first appeared in row %lld.
zh_hant: 重複的描述「%1$@」— 首次出現於第 %2$lld 列。

source: Expected %lld fields but found %lld.
zh_hant: 預期有 %1$lld 個欄位，但實際有 %2$lld 個。

source: Expected UTF-8 encoded text.
zh_hant: 預期為 UTF-8 編碼文字。

source: File contains no data rows.
zh_hant: 檔案不包含任何資料列。

source: File is empty or contains no data.
zh_hant: 檔案為空或不包含任何資料。

source: Malformed CSV quoting.
zh_hant: CSV 檔案包含無效的引號格式。

source: Map CSV Columns
zh_hant: 對應 CSV 欄位

source: Mapping missing required columns.
zh_hant: 欄位對應缺少必要欄位。

source: Market value is negative for '%@'.
zh_hant: 「%@」的市場價值為負數。

source: Market value is zero for '%@'.
zh_hant: 「%@」的市場價值為零。

source: Missing required column: Amount
zh_hant: 缺少必要欄位：Amount

source: Missing required column: Asset Name
zh_hant: 缺少必要欄位：Asset Name

source: Missing required column: Description
zh_hant: 缺少必要欄位：Description

source: Missing required column: Market Value
zh_hant: 缺少必要欄位：Market Value

source: None
zh_hant: 無

source: Snapshot date cannot be in the future.
zh_hant: 快照日期不能是未來的日期。

source: The CSV file is missing a column.
zh_hant: CSV 檔案缺少欄位。

source: The CSV row is out of bounds.
zh_hant: CSV 列超出範圍。

source: The CSV value could not be parsed.
zh_hant: 無法剖析 CSV 值。

# This asset is currently assigned to %@. Importing will reassign it to %@.
source: This asset is currently assigned to %1$@. Importing will reassign it to %2$@.
zh_hant: 此資產目前歸類於「%1$@」。匯入後將重新歸類至「%2$@」。

# This asset's currency is currently '%@'. Importing will change it to '%@'.
source: This asset's currency is currently '%1$@'. Importing will change it to '%2$@'.
zh_hant: 此資產的幣別目前為「%1$@」。匯入後將變更為「%2$@」。

source: Two or more columns are mapped to the same field.
zh_hant: 有兩個以上的欄位被指定為相同的欄位。

source: Unable to read CSV data.
zh_hant: 無法讀取 CSV 資料。

source: Unrecognized column: %@ (will be ignored)
zh_hant: 無法識別的欄位：%@（將被忽略）

# Unsupported currency '%@' in row %lld.
source: Unsupported currency '%1$@' in row %2$lld.
zh_hant: 第 %2$lld 列的幣別「%1$@」不被支援。

source: Unsupported currency '%@'.
zh_hant: 幣別「%@」不被支援。

source: Use the dropdowns above each column to assign it to the corresponding field.
zh_hant: 使用每個欄位上方的下拉選單，將其指定為對應的欄位。
